# brew tap
tap 'homebrew/cask'
# set arguments for all 'brew cask install' commands
cask_args appdir: '~/Applications'

# brew install
brew 'mas'
brew 'python'
brew 'pre-commit'
brew 'nvm'
brew 'go'

# brew cask install
cask 'aerial'
cask 'alfred'
cask 'firefox'
cask 'figma'
cask 'github'
cask 'goland'
cask 'google-chrome'
cask 'hyper'
cask 'istat-menus'
cask 'notion'
cask 'postman'
cask 'skitch'
cask 'slack'
cask 'spectacle'
cask 'textmate'
cask 'vagrant'

# brew mas install
mas 'Xcode', id: 497799835
mas 'iAWriter', id: 775737590
mas 'Lungo', id: 1263070803
mas 'Slack', id: 803453959
